"use strict";
//Задача 1 Получить верное значение округления
let numOne = Math.round(1.005 * 100) / 100;
console.log(numOne);

//Задача 2 Получить число 135.58
let value = "135.58px";
console.log(value);

//Задача 3 Построить верное условное ветвление
let value2 = 58 + "Фрилансер";
if (true) {
    console.log('Результат выражения NaN');
}
//Задача 4 Найти максимальное число из 10,58,39,-150,0
//Задача 5 Округлить число 58.858 до числа 58




//Задача 6 Верна ли запись?
//Должно быть "Привет! Я фрилансер"
let fls = "Фрилансер";
let text = 'Привет! Я ${fls}';
console.log(text);


//Задача 7 Получить символ "н" строки:
let text2 = 'Фрилансер';
console.log(text2);
//Задача 8 Верно? Ожидаем 579
let text3 = 123 + "456";
console.log(text3);
//Задача 9 Получить строку в верхнем регистре
let text4 = 'Фрилансер';
console.log(text4);
//Задача 10 Получить подстроку "лан"
let text5 = 'Фрилансер';
console.log(text5);
//Задача 11 true or false? 
let text6 = 'Фрилансер';
console.log(text.includes('лан', 4));
